{"/accession/application/exigencies/":{"data":{"":"If you intend to submit an application in an upcoming cycle, these are the things you should push as early as possible.","af-form-422#AF Form 422":"The AF Form 422 is used to provide a snapshot of your current medical status. This document can take anywhere from a few days to a few weeks to obtain, and acts as a blocker to other processes, so it is imperative that you get this done as soon as possible.\nThe AF422 is valid for 1 year (??) and must have a very specific statement as determined by the board. As of the FY26 board, the statement was as follows. Please ensure it has not changed for the current board.\nBased on full record review, the member is medically qualified for continued enlistment, commissioning, cleared for worldwide duty, and does not have an ALC or in the process of a medical evaluation board (MEB). Also, member doe not have an AF Form 460. Duty Limiting Condition Report, describing duty limitation or exemption from any component for Fitness Testing. Mamber has/has not has PRK or Lasik surgery. Surgery date was: MM/DD/YYYY. To request an AF Form 422, do the following:\nGo to myIMR. Go to the Medical Clearance tab and click Start New Medical Clearance Request Select Retraining/Reclass/Commissioning/IFC/Special Duty/DSD What type of Retraining/Reclass do you need?: Commission What is the application deadline?: Board submission deadline (or WOTS start date) - Your AF422 will not be processed until 90 days prior - Deadline must be at least 31 days out List all AFSC’s/SDI/Positions you are applying for: 17?X? Answer the other questions Page 3 Additional Comments: Req stmt in Genesis - KACC says they want the blurb here, but you’re only given 20 characters in this textarea. Note the email address on page 4. Send an email to the aforementioned email address with something along the following. Ensure you update the required verbiage as necessary per AF Accessions instructions:\nI have submitted a request for an AF 422 and am requesting the following verbiage: Based on full record review, the member is medically qualified for continued enlistment or commissioning, is cleared for wordwide duty, and does not have an Assignment Limitation Code (ALC), nor are they in the process of a Medical Evaluation Board (MEB). Also, the member does not have an AF Form 469 (Duty Limiting Condition Report) describing duty limitations or exemption from any component for Fitness Testing. Member has had PRK/LASIK surgery. Surgery date was MM/DD/YYYY. Your Readiness Team may respond to this email requesting this verbiage be requested via MHS Genesis.\nCheck the IMR tab for an AF422 link daily. This is where your AF422 will be found and you may not recieve any notification that it is ready for download.\nYour AF422 will need to be valid through WOTS graduation, and as such, you may need to re-request it as you get closer to your WOTS class date after you have been initially selected. The process should be identical at that point. If you show up to WOTS with an expired AF422, you will be sent home.","afcep-request#AFCEP Request":"Once you have all documents completed, you will upload them via a website called AFCEP. It can be a bit of a time consuming hassle to get access to AFCEP, so it is highly recommended that you begin the process of requesting an account as early as possible.\nMore information coming soon…"},"title":"0. Exigencies"},"/accession/selection/considerations/assignments/":{"data":{"":"It appears that generally speaking, WO selects are being assigned where they are currently stationed, however, it is highly dependant on the “Needs of the Air Force” and will not be the case for everyone.\nAssignment availability can be seen in AMS.\nOnce assignments have started to load, you can see if you have any by using the EFMP trick described below: (Or click this link until it actually loads)\nGo to the vMPF. Select Assignments -\u003e Exceptional Family Member Program Application from the menu. Select Apply to Change or Cancel Assignment, Travel of EFMP Family Member Non-Recommended from the sidebar. If you do NOT have orders, it will say “The system of record (MilPDS) does not show that you have a projected assignment”. Otherwise, you do. This trick, however, will not show you were you have orders to. Select Remove my EMFP application from the sidebar to fully cancel the application. "},"title":"Assignments"}}