{"/accession/":{"data":{"":"This section intends to go over the process of applying and being selected for Warrant Officer.\n25WOTS02 Deadline Days Hours Minutes Seconds "},"title":"Accession"},"/accession/application/":{"data":{"":"Information about the Application Process."},"title":"1. Application"},"/accession/application/docs-conditional/":{"data":{"":"This section contains information about the documents that will be uploaded as part of your package, but that may not apply to all applicants.\nThis information is not authoritative, and if there is a discrepancy between the information here and the information the the Board Announcement PSDM, you are strongly encouraged to follow the PSDM."},"title":"2. Documents (Conditional)"},"/accession/application/docs/":{"data":{"":"This section contains information about the documents that will be uploaded as part of your package.\nThis information is not authoritative, and if there is a discrepancy between the information here and the information the the Board Announcement PSDM, you are strongly encouraged to follow the PSDM."},"title":"1. Documents"},"/accession/application/docs/app/":{"data":{"":"This section contains information about the Application document, which should be uploaded as Doe, Jane AD WO App.pdf.","components#Components":"AF WO Application Endorsement Letter of Recommendation Technical Letter of Recommendation Applicant Statement Sq CC Interview SIP "},"title":"Application"},"/accession/application/docs/srce/":{"data":{"":"This section contains information about the Source Document, which should be uploaded as Doe, Jane Srce.pdf.","components#Components":"Eligibility Determination Questionaire vMPF Career Data Verification Brief Commander’s PIF Quality Force Review Letter AF Form 4428 (If Applicable) Pregnancy MFR (If Applicable) AF Form 422 Other Misc Items "},"title":"Source"},"/accession/application/exigencies/":{"data":{"":"If you intend to submit an application in an upcoming cycle, these are the things you should push as early as possible.","af-form-422#AF Form 422":"The AF Form 422 is used to provide a snapshot of your current medical status. This document can take anywhere from a few days to a few weeks to obtain, and acts as a blocker to other processes, so it is imperative that you get this done as soon as possible.\nThe AF422 is valid for 1 year (??) and must have a very specific statement as determined by the board. As of the FY26 board, the statement was as follows. Please ensure it has not changed for the current board.\nBased on full record review, the member is medically qualified for continued enlistment, commissioning, cleared for worldwide duty, and does not have an ALC or in the process of a medical evaluation board (MEB). Also, member doe not have an AF Form 460. Duty Limiting Condition Report, describing duty limitation or exemption from any component for Fitness Testing. Mamber has/has not has PRK or Lasik surgery. Surgery date was: MM/DD/YYYY. To request an AF Form 422, do the following:\nGo to myIMR. Go to the Medical Clearance tab and click Start New Medical Clearance Request Select Retraining/Reclass/Commissioning/IFC/Special Duty/DSD What type of Retraining/Reclass do you need?: Commission What is the application deadline? List all AFSC’s/SDI/Positions you are applying for: 17?X? Answer the other questions Please send your CC/FM approval letter, AFPC email, and AMS listing; any verbiage required on the AF Form 422, plus any other required document to:…..\nCheck the IMR tab for an AF422 link daily. This is where your AF422 will be found and you may not recieve any notification that it is ready for download.","afcep-request#AFCEP Request":"Once you have all documents completed, you will upload them via a website called AFCEP. It can be a bit of a time consuming hassle to get access to AFCEP, so it is highly recommended that you begin the process of requesting an account as early as possible.\nMore information coming soon…"},"title":"0. Exigencies"},"/accession/selection/":{"data":{"":"This section is intended to provide useful information for those who have been selected."},"title":"2. Selection"},"/accession/selection/considerations/":{"data":{"":"There are a few things that you don’t really have a ton of control over, but that you can keep in mind or may want to know about."},"title":"2. Considerations"},"/accession/selection/considerations/assignments/":{"data":{"":"It appears that generally speaking, WO selects are being assigned where they are currently stationed, however, it is highly dependant on the “Needs of the Air Force” and will not be the case for everyone.\nAssignment availability can be seen in AMS."},"title":"Assignments"},"/accession/selection/considerations/class-selection/":{"data":{"":"After Constructive Service Credit and follow on location have been determined, a class date will be chosen for you. You may reach out to request a specific class if you have substantial reason to, but this process is very much so “Needs of the Air Force” and you may not have much if a choice.\nIf you do have a substantial reason to request a specific class, it is helpful to request it at the same time you submit your Post-Selection Package."},"title":"Class Selection"},"/accession/selection/considerations/csc/":{"data":{"":"Once you have been selected to become a Warrant Officer, your prior service will be evaluated to make a determination as to where you will enter the Warrant Officer ranks. This process is known as “Constructive Service Credit” assessment.\nThe Constructive Service Credit process takes approximately one month, and plays a large part in your class number. The YY-01 class will be filled with the remaining members of the prior year’s selectees. YY-02 will be filled with those who did not have enough CSC to make W-2. YY-03 is the first class that will have W-2’s (as well as OCONUS members). YY-04 will have the remaining W-2’s. Obviously emergencies and other critical factors may vary this on a case by case basis.\nMore information coming soon…"},"title":"Constructive Service Credit"},"/accession/selection/considerations/finances/":{"data":{"":"After being selected for WOTS, you will be expected spend a significant amount of money on uniforms/etc. There are ways to be compensated for some of this cost which will be described here.","clothing-allowance#Clothing Allowance":"Coming soon…","family-separation-allowance-fsa#Family Separation Allowance (FSA)":"Coming soon…"},"title":"Finances"},"/accession/selection/exigencies/accept/":{"data":{"":"After you have been selected, you must immediately submit a package to confirm your acceptance. Failure to submit this package in time (usually within a week of announcement) may result in revocation of selection.","components#Components":"Form Security Clearance Memo If you already carry the necessary security clearance and it is not set to expire/renew within the next year (??), you do not need to submit a memo. The purpose of this memo is to show progress is being made to ensure proper clearance upon WOTS graduation."},"title":"Acceptance"},"/accession/selection/wots/":{"data":{"":"Warrant Officer Training School notes"},"title":"1. WOTS"},"/accession/selection/wots/fitness/":{"data":{"":"WOTS can be very physically demanding, this section is intended to provide some recommendations on that front."},"title":"Fitness"},"/accession/selection/wots/packing/":{"data":{"":"The official packing list can be found in the WOTS Reporting Guide.\nService Uniform Dress Shoes\nBlack, dress, oxford, or plain toe – High heels/pumps are not authorized\nMinimum: 1\nRecommended: 1\n♂\n♀\nOfficer Service Coat\nMust have dark braid and epaulets attached. Maxwell Alterations has 5 weeks turn around\nMinimum: 1\nRecommended: 1\nhyperlink\nBlues Pants\nWool or polyester w/ a minimum of 1 wool\nMinimum: 1\nRecommended: 1\n♂\n♀\nBlues Shirt (Long Sleeve)\nMinimum: 1\nRecommended: 2\n♂\n♀\nBlues Shirt (Short Sleeve)\nMinimum: 1\nRecommended: 2\n♂\n♀\nFlight Cap\nSilver \u0026 Blue Braid – NOT General Officer Silver Braid\nMinimum: 1\nRecommended: 1\nNeck Tie\nMinimum: 1\nRecommended: 1\n♂\nNeck Tab\nMinimum: 1\nRecommended: 1\n♀\nBelt\nBlue w/ Chrome Buckle\nMinimum: 1\nRecommended: 1\nhyperlink\nUndershirts\nMinimum: 2\nRecommended: 3\nhyperlink\nBlack Dress Socks\nMinimum: 2\nRecommended: 4\nhyperlink\nShirt Garters\nMinimum: 1\nRecommended: 1\nhyperlink\nLightweight Jacket\nMay be embroidered\nMinimum: 1\nRecommended: 1\nhyperlink\nBlues Name Tag\nMinimum: 1\nRecommended: 1\nhyperlink\nService Dress Name Tag\nMinimum: 1\nRecommended: 1\nhyperlink\nUS Officer Lapel Pins\nSet of 2\nMinimum: 1\nRecommended: 1\nMetal Rank\n2x for Service Coat, 1x for Hat – Available for purchase at Maxwell Clothing Sales\nMinimum: 3\nRecommended: 3\nFull Ribbon Rack\nMinimum: 3\nRecommended: 3\nRequired Duty Badges\nMinimum: 0\nRecommended: 1","official-images#Official Images":" "},"title":"Packing"},"/resources/":{"data":{"":" All 2025 Personnel Services Deliver Memorandums (PSDMs) Air Force Accessions Center: Warrant Officer Program PSDM 25-23: FY26 Warrant Officer Selection Board Announcement Warrant Officer Post Selection Instructions WOTS Reporting Guide "},"title":"Resources"}}