{"/accession/":{"data":{"":"This section intends to go over the process of applying and being selected for Warrant Officer.\n25WOTS02 Deadline Days Hours Minutes Seconds "},"title":"Accession"},"/accession/application/":{"data":{"":"Information about the Application Process."},"title":"1. Application"},"/accession/application/docs/":{"data":{"":"This section contains information about the documents that will be uploaded as part of your package.\nThis information is not authoritative, and if there is a discrepancy between the information here and the information the the Board Announcement PSDM, you are strongly encouraged to follow the PSDM."},"title":"Documents"},"/accession/application/docs/app/":{"data":{"":"This section contains information about the Application document, which should be uploaded as Doe, Jane AD WO App.pdf.","components#Components":"AF WO Application Endorsement Letter of Recommendation Technical Letter of Recommendation Applicant Statement Sq CC Interview SIP "},"title":"Application"},"/accession/application/docs/srce/":{"data":{"":"This section contains information about the Source Document, which should be uploaded as Doe, Jane Srce.pdf.","components#Components":"Eligibility Determination Questionaire vMPF Career Data Verification Brief Commander’s PIF Quality Force Review Letter AF Form 4428 (If Applicable) Pregnancy MFR (If Applicable) AF Form 422 Other Misc Items "},"title":"Source"},"/accession/application/urgent/":{"data":{"":"If you intend to submit an application in an upcoming cycle, these are the things you should push as early as possible.","af-form-422#AF Form 422":"The AF Form 422 is used to provide a snapshot of your current medical status. This document can take anywhere from a few days to a few weeks to obtain, and acts as a blocker to other processes, so it is imperative that you get this done as soon as possible.\nThe AF422 is valid for 1 year (??) and must have a very specific statement as determined by the board. As of the FY26 board, the statement was as follows. Please ensure it has not changed for the current board.\nTo request an AF Form 422, do the following:\nGo to myIMR Go to the Medical Clearance tab and click Start New Medical Clearance Request More steps coming soon… ","afcep-request#AFCEP Request":"Once you have all documents completed, you will upload them via a website called AFCEP. It can be a bit of a time consuming hassle to get access to AFCEP, so it is highly recommended that you begin the process of requesting an account as early as possible.\nMore information coming soon…"},"title":"Urgent Actions"},"/accession/selection/":{"data":{"":"This section is intended to provide useful information for those who have been selected."},"title":"2. Selection"},"/accession/selection/csc/":{"data":{"":"Once you have been selected to become a Warrant Officer, your prior service will be evaluated to make a determination as to where you will enter the Warrant Officer ranks. This process is known as “Constructive Service Credit” assessment.\nMore information coming soon…"},"title":"Constructive Service Credit"},"/accession/selection/finances/":{"data":{"":"After being selected for WOTS, you will be expected spend a significant amount of money on uniforms/etc. There are ways to be compensated for some of this cost which will be described here.","clothing-allowance#Clothing Allowance":"Coming soon…","family-separation-allowance-fsa#Family Separation Allowance (FSA)":"Coming soon…"},"title":"Finances"},"/accession/selection/wots/":{"data":{"":"WOTS Index"},"title":"WOTS"},"/accession/selection/wots/fitness/":{"data":{"":"WOTS can be very physically demanding, this section is intended to provide some recommendations on that front."},"title":"Fitness"},"/accession/selection/wots/packing/":{"data":{"":"","packing-for-warrant-officer-training-school-wots#Packing for Warrant Officer Training School (WOTS)":"Packing for Warrant Officer Training School (WOTS) The official packing list can be found in the WOTS Reporting Guide."},"title":"Packing"},"/resources/":{"data":{"":" All 2025 Personnel Services Deliver Memorandums (PSDMs) Air Force Accessions Center: Warrant Officer Program PSDM 25-23: FY26 Warrant Officer Selection Board Announcement Warrant Officer Post Selection Instructions WOTS Reporting Guide "},"title":"Resources"}}